Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadCombination.ScalingFactors Property
 Gets or sets the scaling factors of the analysis load combination.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<double> ScalingFactors { get; set; }
Public Property ScalingFactors As List(Of Double)
	Get
	Set
Property Value
Type: List<Double>
See Also
Reference
AnalysisLoadCombination Class
Tekla.Structures.Analysis Namespace